TEANAET/greenhouse_stm32/stm32_usart3-mqttx透传/HARDWARE/src/led.c
 
/*-------------------------------------------------*/
/*         	                                       */
/*           	 LED（补光灯）控制           	    */
/*                                                 */
/*-------------------------------------------------*/

// 硬件连接：
// PD2  LED0

#include "stm32f10x.h"  //包含需要的头文件
#include "led.h"        //包含需要的头文件
/*-------------------------------------------------*/
/*函数名：初始化LED函数,PC0.1.2.3,共阳极连接 	    */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED_Init(void)
{    	 
	GPIO_InitTypeDef GPIO_InitStructure;                     
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);    
	GPIO_InitStructure.GPIO_Pin = LED_PIN;   
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;     
	GPIO_Init(GPIOB, &GPIO_InitStructure); 
	GPIO_SetBits(GPIOB, LED_PIN); 						 //PC.0.1.2.3 输出高 
}
/*-------------------------------------------------*/
/*函数名：初始化LED2函数	    */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED2_Init(void)
{    	 
	GPIO_InitTypeDef GPIO_InitStructure;                     
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);    
	GPIO_InitStructure.GPIO_Pin = LED_PIN2;   
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;     
	GPIO_Init(GPIOB, &GPIO_InitStructure); 
	GPIO_ResetBits(GPIOB, LED_PIN2); 						 //PC.0.1.2.3 输出高 
}
/*-------------------------------------------------*/
/*函数名：LED开启                                  */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED_On(void)
{			
	GPIO_ResetBits(GPIOB, LED_PIN); 						 //PC.0.1.2.3 输出低
} 


/*-------------------------------------------------*/
/*函数名：LED关闭                                  */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED_Off(void)
{		
	GPIO_SetBits(GPIOB, LED_PIN); 						 //PC.0.1.2.3 输出高
}
/*-------------------------------------------------*/
/*函数名：LED开启                                  */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED2_On(void)
{			
	GPIO_SetBits(GPIOB, LED_PIN2); 						 //PC.0.1.2.3 输出高
} 


/*-------------------------------------------------*/
/*函数名：LED关闭                                  */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED2_Off(void)
{		
	GPIO_ResetBits(GPIOB, LED_PIN2); 						 //PC.0.1.2.3 输出低
	
}



